{"id": 0, "user_request": "give me the number of movies directed by Sofia Coppola"}
{"id": 1, "user_request": "Who was the lead actor in the movie The Dark Knight?"}
{"id": 2, "user_request": "Who directed the top-1 rated movie?"}
{"id": 3, "user_request": "give me a image for the collection Star Wars"}
{"id": 4, "user_request": "What is the logo of the Walt Disney?"}
{"id": 5, "user_request": "What dose the lead actor of Titanic look like?"}
{"id": 6, "user_request": "give me some reviews of the first movie that is similar to Titanic"}
{"id": 7, "user_request": "I just finished watching Titanic and I want some other movie recommendations"}
{"id": 8, "user_request": "What is the latest movie directed by Christopher Nolan?"}
{"id": 9, "user_request": "tell me the highest rated movie directed by Martin Scorsese"}
{"id": 10, "user_request": "Who is the director of Leonardo DiCaprio's latest movie?"}
{"id": 11, "user_request": "tell me a TV show recently directed by Catherine Hardwicke"}
{"id": 12, "user_request": "Please recommend me some TV shows similar to Breaking Bad"}
{"id": 13, "user_request": "Who is the director of today's most trending movie?"}
{"id": 14, "user_request": "Who is the director of the movie \"Twilight\"?"}
{"id": 15, "user_request": "give me a photo belong to the second episode of the first season of the Witcher"}
{"id": 16, "user_request": "What is top-1 rated movie?"}
{"id": 17, "user_request": "What is the release date of the movie \"The Matrix\"?"}
{"id": 18, "user_request": "Who is the most popular person?"}
{"id": 19, "user_request": "Give me some cover images of movies directed by Christopher Nolan."}
{"id": 20, "user_request": "What are some common keywords associated with movie \"Titanic\"?"}
{"id": 21, "user_request": "Give me a show that is currently on the air"}
{"id": 22, "user_request": "When is Clint Eastwood's latest movie scheduled to be released?"}
{"id": 23, "user_request": "Give me some movie reviews about The Dark Knight"}
{"id": 24, "user_request": "What are some movies that are similar to one of the movies directed by Francis Ford Coppola?"}
{"id": 25, "user_request": "Who is the lead actor in the latest released movie?"}
{"id": 26, "user_request": "give me one image of the movie that is currently showing in theaters"}
{"id": 27, "user_request": "What is the most popular movie right now and what is its keywords?"}
{"id": 28, "user_request": "What are the keywords of the most popular movie right now"}
{"id": 29, "user_request": "Who has starred in a movie \"Titanic\""}
{"id": 30, "user_request": "What do the logo looks like for Paramount Pictures?"}
{"id": 31, "user_request": "tell me where the company \"universal pictures\" was founded?"}
{"id": 32, "user_request": "When is the movie \"Titanic\" released?"}
{"id": 33, "user_request": "Who has starred in the first movie of Star Wars collection?"}
{"id": 34, "user_request": "give me a movie cover of a movie from the collection Harry Potter"}
{"id": 35, "user_request": "What are some keywords for a movie of the collection The Hunger Games?"}
{"id": 36, "user_request": "When are the release dates for the movies of the collection The Hobbit?"}
{"id": 37, "user_request": "List movies from The Fast and the Furious collection"}
{"id": 38, "user_request": "Give me a review of a movie from the collection The Fast and the Furious."}
{"id": 39, "user_request": "When was the first movie of the collection Lord of the Rings released?"}
{"id": 40, "user_request": "tell me the directors of the first season of House of Cards"}
{"id": 41, "user_request": "I want some tv shows that similar to House of Cards"}
{"id": 42, "user_request": "When did the most popular TV show currently on the air start?"}
{"id": 43, "user_request": "tell me a few more works directed by the director of Django Unchained"}
{"id": 44, "user_request": "tell me the cast of a TV show on the air"}
{"id": 45, "user_request": "I need a review for Breaking Bad"}
{"id": 46, "user_request": "I'm watching the tv series The Last Of Us and I need some more recommendations"}
{"id": 47, "user_request": "I'm watching a TV show called The Last Of Us and I need some more recommendations"}
{"id": 48, "user_request": "tell me the guest star from season 3, episode 24 of Friends"}
{"id": 49, "user_request": "Who is the lead actor in the most popular TV show?"}
{"id": 50, "user_request": "give me a keyword of the top-1 rated TV show"}
{"id": 51, "user_request": "give me a poster of 2 Broke Girls"}
{"id": 52, "user_request": "How many episodes does 2 Broke Girls have in total?"}
{"id": 53, "user_request": "When was the company that produced The Big Bang Theory founded?"}
{"id": 54, "user_request": "When was the TV show The Big Bang Theory created?"}
{"id": 55, "user_request": "give me a keyword of the most popular TV show"}
{"id": 56, "user_request": "What did the third episode of the second season of Westworld talk about?"}
{"id": 57, "user_request": "Tell me the air date of the second season of Game of Thrones"}
{"id": 58, "user_request": " give me a poster of the third episode of Band of Brothers"}
{"id": 59, "user_request": "What is the logo of the network that produced Game of Thrones?"}
{"id": 60, "user_request": "give me the homepage of the network that produced Game of Thrones"}
{"id": 61, "user_request": "give me a keyword of the most popular TV show currently"}
{"id": 62, "user_request": "Where is the headquarter of the company that produced currently the most popular TV show?"}
{"id": 63, "user_request": "What is the genre of The Mandalorian?"}
{"id": 64, "user_request": "When is the birthday of the lead actor of today's most trending TV show?"}
{"id": 65, "user_request": "What is the homepage of the network that produced today's most trending TV show?"}
{"id": 66, "user_request": "give me a review of today's most trending TV show"}
{"id": 67, "user_request": "I prefer a TV show that similar to today's most trending TV show"}
{"id": 68, "user_request": "I need a poster of today's most trending TV show"}
{"id": 69, "user_request": "Who has worked with Jeremy Clarkson in his most popular TV show?"}
{"id": 70, "user_request": "What does the lead actor of the first episode of second season of Black Mirror look like?"}
{"id": 71, "user_request": "When is the lead actor of The Mandalorian born?"}
{"id": 72, "user_request": "Who is the lead actor of today's most popular TV show?"}
{"id": 73, "user_request": "give me a photo of the lead actor of the most popular TV show of this week"}
{"id": 74, "user_request": "give me some reviews of Cate Blanchett's latest TV show"}
{"id": 75, "user_request": "What is David Schwimmer's most popular TV show?"}
{"id": 76, "user_request": "Who directed the third episode of the second season of Black Mirror?"}
{"id": 77, "user_request": "give me some movies that Christopher Nolan known for"}
{"id": 78, "user_request": "Avatar versus Avatar: The Way of Water, which has a higher rating"}
{"id": 79, "user_request": "Show me some English movies rating no less than 7.0 and no earlier than 2021"}
{"id": 80, "user_request": "What is the genre of the movie Lord of the Ring?"}
{"id": 81, "user_request": "What is the birthday of the most popular person right now?"}
{"id": 82, "user_request": "give me a poster of the second season of Big Bang Theory"}
{"id": 83, "user_request": "What is the name of the third episod of the second season of Mandalorian?"}
{"id": 84, "user_request": "When is the bitrhday of the lead actor of the movie The Shawshank Redemptionn?"}
{"id": 85, "user_request": "When is the birthday of the director of the movie The Shawshank Redemption?"}
{"id": 86, "user_request": "Where is the headquarter of the company that created the movie The Shawshank Redemption?"}
{"id": 87, "user_request": "Where is the headquarter of the company that created the collection Star Wars?"}
{"id": 88, "user_request": "Who has an earlier release date, The Double Life of Veronique or Mulholland Drive?"}
{"id": 89, "user_request": "Is the director of Twin Peaks Season 1 and Mulholland Drive the same person?"}
{"id": 90, "user_request": "Where was the director of Mulholland Drive born?"}
{"id": 91, "user_request": "Is Mulholland Drive in the Top-10 rated list of the TMDB?"}
{"id": 92, "user_request": "Who directed more movies, Akira Kurosawa or Spielberg?"}
{"id": 93, "user_request": "What TV series has the director of Mulholland Drive directed?"}
{"id": 94, "user_request": "Tell me about actor Scarlett Johansson's birthday"}
{"id": 95, "user_request": "How many seasons of Sword Art Online are there?"}
{"id": 96, "user_request": "Are Yui Aragaki and Gen Hoshino co-starring in We Married as Job?"}
{"id": 97, "user_request": "Who is older, by how many years, the director of film Barbie or the lead actor of television DEATH NOTE?"}
{"id": 98, "user_request": "Tell me about Katherine LaNasa's latest movie appearance."}
{"id": 99, "user_request": "Give me one cover image of the movie Oppenheimer."}
